---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheet.FabricNumber
source: html/df1c73ae-b662-98c4-5760-9ad74d60970e.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.FabricNumber Property

Specifies the numerical parameter assigned to the fabric sheet and any sheet of the same type, dimension, material, shape, and partition.

## Syntax (C#)
```csharp
public string FabricNumber { get; }
```

## Remarks
Value of this property corresponds to the Fabric Number parameter of Rebar as available in both the UI and API. Refer to the [!:NumberingSchema] class for details related to numbering Rebar and Fabrics.